{
    "server100": {
        "title": "ادامه",
        "body": "یک پاسخ موقت به مشتری نشان می دهد که قسمت اولیه درخواست دریافت شده و هنوز توسط سرور رد نشده است. مشتری باید با ارسال باقیمانده درخواست ادامه دهد یا اگر درخواست قبلاً تکمیل شده است، این پاسخ را نادیده بگیرد. سرور باید پس از تکمیل درخواست پاسخ نهایی را ارسال کند."
    },
    "server101": {
        "title": "پروتکل سوئیچینگ",
        "body": "در پاسخ به هدر درخواست ارتقاء از مشتری ارسال می‌شود و پروتکلی را که سرور به آن تغییر می‌دهد را نشان می‌دهد."
    },
    "server102": {
        "title": "پردازش",
        "body": "نشان می دهد که سرور درخواست را دریافت کرده و در حال پردازش است، اما هنوز پاسخی در دسترس نیست."
    },
    "server103": {
        "title": "نکات اولیه",
        "body": "در اصل برای استفاده با Linkهدر در نظر گرفته شده است. این نشان می دهد که عامل کاربر شروع به بارگذاری از قبل منابع در حالی که سرور پاسخ نهایی را آماده می کند."
    },
    "server200": {
        "title": "باشه",
        "body": "نشان می دهد که درخواست با موفقیت انجام شده است."
    },
    "server201": {
        "title": "ایجاد شد",
        "body": "نشان می دهد که درخواست موفقیت آمیز بوده و در نتیجه یک منبع جدید ایجاد شده است."
    },
    "server202": {
        "title": "پذیرفته شد",
        "body": "نشان می دهد که درخواست دریافت شده است اما هنوز تکمیل نشده است. معمولاً در درخواست‌های اجرای گزارش و پردازش دسته‌ای استفاده می‌شود."
    },
    "server203": {
        "title": "اطلاعات غیر معتبر",
        "body": "نشان می دهد که فرااطلاعات برگشتی در هدر نهاد مجموعه قطعی موجود در سرور مبدا نیست، بلکه از یک نسخه محلی یا یک کپی شخص ثالث جمع آوری شده است. مجموعه ارائه شده ممکن است زیرمجموعه یا ابرمجموعه نسخه اصلی باشد."
    },
    "server204": {
        "title": "بدون محتوا",
        "body": "سرور درخواست را برآورده کرده است اما نیازی به بازگشت بدنه پاسخ ندارد. سرور ممکن است اطلاعات متا به روز شده را برگرداند."
    },
    "server205": {
        "title": "بازنشانی محتوا",
        "body": "به مشتری برای بازنشانی سندی که این درخواست را ارسال کرده است نشان می دهد."
    },
    "server206": {
        "title": "محتوای جزئی",
        "body": "زمانی استفاده می شود که Rangeهدر از مشتری برای درخواست تنها بخشی از یک منبع ارسال می شود."
    },
    "server207": {
        "title": "چند وضعیت",
        "body": "یک نشانگر برای مشتری مبنی بر اینکه چندین عملیات اتفاق افتاده است و وضعیت هر عملیات را می توان در بدنه پاسخ یافت."
    },
    "server208": {
        "title": "قبلاً گزارش شده است",
        "body": "به یک سرویس گیرنده اجازه می دهد تا به سرور بگوید که همان منبع (با همان اتصال) قبلاً ذکر شده است. هرگز به عنوان یک کد پاسخ HTTP واقعی در خط وضعیت ظاهر نمی شود و فقط در بدنه ها ظاهر می شود."
    },
    "server226": {
        "title": "IM استفاده می شود",
        "body": "سرور یک درخواست GET برای منبع را برآورده کرده است، و پاسخ نمایشی از نتیجه یک یا چند نمونه-دستکاری اعمال شده در نمونه فعلی است."
    },
    "server300": {
        "title": "گزینه چندگانه",
        "body": "درخواست بیش از یک پاسخ ممکن دارد. عامل کاربر یا کاربر باید یکی از آنها را انتخاب کند."
    },
    "server301": {
        "title": "به طور دائم منتقل شد",
        "body": "URL منبع درخواستی برای همیشه تغییر کرده است. URL جدید توسط Locationفیلد هدر در پاسخ داده می شود. این پاسخ قابل ذخیره سازی است مگر اینکه خلاف آن مشخص شده باشد."
    },
    "server302": {
        "title": "پیدا شد",
        "body": "URL منبع درخواستی به طور موقت تغییر کرده است. URL جدید توسط Locationفیلد موجود در پاسخ داده می شود. این پاسخ فقط در صورتی قابل ذخیره است که با فیلد Cache-Controlیا Expiresهدر نشان داده شود."
    },
    "server303": {
        "title": "رجوع به دیگر شود",
        "body": "پاسخ را می توان تحت یک URI دیگر یافت و باید با استفاده از روش GET در آن منبع بازیابی شود."
    },
    "server304": {
        "title": "اصلاح نشده است",
        "body": "به مشتری نشان می دهد که پاسخ اصلاح نشده است، بنابراین مشتری می تواند به استفاده از همان نسخه کش پاسخ ادامه دهد."
    },
    "server305": {
        "title": "استفاده از پروکسی (منسوخ شده)",
        "body": "نشان می دهد که یک پاسخ درخواستی باید توسط یک پروکسی قابل دسترسی باشد."
    },
    "server306": {
        "title": "استفاده نشده",
        "body": "این یک کد وضعیت رزرو شده است و دیگر استفاده نمی شود."
    },
    "server307": {
        "title": "تغییر مسیر موقت",
        "body": "به مشتری نشان می دهد که منبع درخواستی را در یک URI دیگر با همان روشی که در درخواست قبلی استفاده شده بود، دریافت کند. مشابه این است 302 Foundکه با یک استثنا از همان روش HTTP استفاده خواهد شد که در درخواست قبلی استفاده شده است."
    },
    "server308": {
        "title": "تغییر مسیر دائمی (تجربی)",
        "body": "نشان می دهد که منبع اکنون به طور دائم در یک URI دیگر که توسط Locationهدر مشخص شده است قرار دارد. مشابه این است 301 Moved Permanentlyکه با یک استثنا از همان روش HTTP استفاده خواهد شد که در درخواست قبلی استفاده شده است."
    },
    "server400": {
        "title": "درخواست بد",
        "body": "درخواست به دلیل نحو نادرست توسط سرور قابل درک نیست. مشتری نباید درخواست را بدون تغییرات تکرار کند."
    },
    "server401": {
        "title": "غیر مجاز",
        "body": "نشان می دهد که درخواست به اطلاعات احراز هویت کاربر نیاز دارد. مشتری ممکن است درخواست را با یک فیلد سرصفحه مجوز مناسب تکرار کند"
    },
    "server402": {
        "title": "پرداخت مورد نیاز (تجربی)",
        "body": "برای استفاده در آینده رزرو شده است. هدف آن استفاده در سیستم های پرداخت دیجیتال است."
    },
    "server403": {
        "title": "ممنوع",
        "body": "درخواست غیرمجاز مشتری حق دسترسی به محتوا را ندارد. برخلاف 401، هویت مشتری برای سرور مشخص است."
    },
    "server404": {
        "title": "پیدا نشد",
        "body": "سرور نمی تواند منبع درخواستی را پیدا کند."
    },
    "server405": {
        "title": "مجاز نیست",
        "body": "روش درخواست HTTP توسط سرور شناخته شده است اما غیرفعال شده است و نمی تواند برای آن منبع استفاده شود."
    },
    "server406": {
        "title": "قابل قبول نیست",
        "body": "سرور هیچ محتوایی را پیدا نمی کند که با معیارهای ارائه شده توسط عامل کاربر در Acceptهدر ارسال شده در درخواست مطابقت داشته باشد."
    },
    "server407": {
        "title": "احراز هویت پروکسی مورد نیاز است",
        "body": "نشان می دهد که مشتری ابتدا باید خود را با پروکسی احراز هویت کند."
    },
    "server408": {
        "title": "درخواست مهلت زمانی",
        "body": "نشان می دهد که سرور یک درخواست کامل از مشتری در مدت زمان تعیین شده سرور دریافت نکرده است."
    },
    "server409": {
        "title": "تعارض",
        "body": "به دلیل تضاد با وضعیت فعلی منبع، درخواست تکمیل نشد."
    },
    "server410": {
        "title": "رفته",
        "body": "منبع درخواستی دیگر در سرور موجود نیست."
    },
    "server411": {
        "title": "طول مورد نیاز است",
        "body": "سرور از پذیرش درخواست بدون یک محتوای تعریف شده امتناع می کند. مشتری ممکن است درخواست را تکرار کند اگر یک Content-Lengthفیلد هدر معتبر اضافه کند."
    },
    "server412": {
        "title": "پیش شرط ناموفق بو",
        "body": "کلاینت در هدرهای خود پیش شرط هایی را مشخص کرده است که سرور آنها را برآورده نمی کند."
    },
    "server413": {
        "title": "درخواست موجودیت خیلی بزرگ است",
        "body": "موجودیت درخواست بزرگتر از محدودیت های تعریف شده توسط سرور است."
    },
    "server414": {
        "title": "درخواست-URI خیلی طولانی است",
        "body": "URI درخواست شده توسط مشتری طولانی تر از آن است که سرور بتواند تفسیر کند."
    },
    "server415": {
        "title": "نوع رسانه پشتیبانی نشده",
        "body": "نوع رسانه Content-typeدرخواست توسط سرور پشتیبانی نمی شود."
    },
    "server416": {
        "title": "محدوده درخواستی قابل رضایت نیست",
        "body": "محدوده مشخص شده توسط Rangeفیلد سرصفحه در درخواست قابل انجام نیست."
    },
    "server417": {
        "title": "انتظار شکست خورد",
        "body": "انتظارات نشان داده شده توسط Expectفیلد هدر درخواست توسط سرور قابل برآورده نیست."
    },
    "server418": {
        "title": "من یک قوری هستم",
        "body": "این به عنوان شوخی لول ماه آوریل تعریف شد و انتظار نمی رود که توسط سرورهای HTTP واقعی پیاده سازی شود. ( RFC 2324 )"
    },
    "server420": {
        "title": "آرامش خود را افزایش دهی",
        "body": "هنگامی که مشتری دارای نرخ محدود است، توسط Twitter Search and Trends API بازگردانده می شود."
    },
    "server422": {
        "title": "موجودیت غیرقابل پردازش",
        "body": "سرور نوع محتوا و نحو موجودیت درخواست را درک می کند، اما همچنان سرور به دلایلی قادر به پردازش درخواست نیست."
    },
    "server423": {
        "title": "قفل شده",
        "body": "منبعی که در حال دسترسی است قفل شده است."
    },
    "server424": {
        "title": "وابستگی ناموفق",
        "body": "درخواست به دلیل عدم موفقیت درخواست قبلی انجام نشد."
    },
    "server425": {
        "title": "خیلی زود",
        "body": "نشان می دهد که سرور مایل به ریسک پردازش درخواستی نیست که ممکن است دوباره پخش شود."
    },
    "server426": {
        "title": "ارتقاء لازم است",
        "body": "سرور از انجام درخواست خودداری می کند. سرور پس از ارتقاء کلاینت به پروتکل دیگری، درخواست را پردازش می کند."
    },
    "server428": {
        "title": "پیش شرط لازم است",
        "body": "سرور مبدا نیاز به شرطی بودن درخواست دارد."
    },
    "server429": {
        "title": "درخواست خیلی زیاد",
        "body": "کاربر در مدت زمان معین درخواست های زیادی ارسال کرده است."
    },
    "server431": {
        "title": "درخواست فیلدهای سرصفحه خیلی بزرگ است",
        "body": "سرور تمایلی به پردازش درخواست ندارد زیرا فیلدهای سرصفحه آن بسیار بزرگ است."
    },
    "server444": {
        "title": "بدون پاسخ",
        "body": "سرور Nginx هیچ اطلاعاتی را به مشتری برمی گرداند و اتصال را می بندد."
    },
    "server449": {
        "title": "سعی مجدد",
        "body": "درخواست باید پس از انجام اقدام مناسب دوباره امتحان شود."
    },
    "server450": {
        "title": "مسدود شده توسط کنترل‌های والدین ویندوز",
        "body": "کنترل‌های والدین ویندوز روشن هستند و دسترسی به صفحه وب داده شده را مسدود می‌کنند."
    },
    "server451": {
        "title": "به دلایل قانونی در دسترس نیست",
        "body": "عامل کاربر منبعی را درخواست کرد که از نظر قانونی قابل ارائه نیست."
    },
    "server499": {
        "title": "درخواست بسته شده",
        "body": "هنگامی که سرور HTTP در حال پردازش درخواست خود است، اتصال توسط کلاینت بسته می شود و سرور قادر به ارسال سرصفحه HTTP به عقب نیست."
    },
    "server500": {
        "title": "خطای سرور داخلی",
        "body": "سرور با یک وضعیت غیرمنتظره مواجه شد که مانع از انجام درخواست شد."
    },
    "server501": {
        "title": "اجرا نشد",
        "body": "روش HTTP توسط سرور پشتیبانی نمی شود و نمی توان آن را مدیریت کرد."
    },
    "server502": {
        "title": "دروازه بد",
        "body": "سرور هنگام کار به عنوان دروازه برای دریافت پاسخ مورد نیاز برای رسیدگی به درخواست، یک پاسخ نامعتبر دریافت کرد."
    },
    "server503": {
        "title": "Gateway Timeout",
        "body": "سرور برای رسیدگی به درخواست آماده نیست."
    },
    "server504": {
        "title": "نسخه HTTP پشتیبانی نمی شود",
        "body": "سرور به عنوان یک دروازه عمل می کند و نمی تواند به موقع برای یک درخواست پاسخ دریافت کند."
    },
    "server505": {
        "title": "",
        "body": "نسخه HTTP استفاده شده در درخواست توسط سرور پشتیبانی نمی شود."
    },
    "server506": {
        "title": "نوع نیز مذاکره می کند",
        "body": "نشان می دهد که سرور دارای یک خطای پیکربندی داخلی است: منبع نوع انتخاب شده برای شرکت در مذاکره محتوای شفاف پیکربندی شده است، و بنابراین نقطه پایانی مناسبی در فرآیند مذاکره نیست."
    },
    "server507": {
        "title": "فضای ذخیره‌سازی ناکافی",
        "body": "این روش را نمی توان بر روی منبع انجام داد زیرا سرور قادر به ذخیره نمایش مورد نیاز برای تکمیل موفقیت آمیز درخواست نیست."
    },
    "server508": {
        "title": "حلقه شناسایی شد",
        "body": "سرور در حین پردازش درخواست، یک حلقه بی نهایت را شناسایی کرد."
    },
    "server510": {
        "title": "تمدید نشده است",
        "body": "پسوندهای بیشتری برای درخواست مورد نیاز است تا سرور بتواند آن را برآورده کند."
    },
    "server511": {
        "title": "احراز هویت مورد نیاز است",
        "body": "نشان می دهد که کلاینت برای دسترسی به شبکه نیاز به احراز هویت دارد."
    }
}